In [0]:
import pandas as pd
import numpy as np


**1. Create a data series with marks of students : 75, 80, 79, 60**

In [4]:
pd.Series([75,80,79,60])

0    75
1    80
2    79
3    60
dtype: int64

**2. Create a data frame with name of students, id and marks**

In [64]:
df = pd.DataFrame({"students" : ["Joe", "Helen", "Adam" , "James","Sarah"],"id" : [1,2,3,4,5], "marks" : [77,None,57,None,90]})
df = df[["students" , "id" , "marks"]]
df

  students  id  marks
0      Joe   1   77.0
1    Helen   2    NaN
2     Adam   3   57.0
3    James   4    NaN
4    Sarah   5   90.0

**3. What are the columns in the dataframe?**

In [65]:
df.columns

Index(['students', 'id', 'marks'], dtype='object')

**4. Sort the data based on Marks obtained. Fill all the 'na' cells with 0**

In [77]:
df= df.sort_values(by = ['marks'] , ascending = False)
df['marks'].fillna(0)

4    90.0
0    77.0
2    57.0
1     0.0
3     0.0
Name: marks, dtype: float64

**5. Display the top 3 rows**

In [78]:
df.head(3)

  students  id  marks
4    Sarah   5   90.0
0      Joe   1   77.0
2     Adam   3   57.0

**6. . Display the last 2 rows**

In [80]:
df.tail(2)

  students  id  marks
1    Helen   2    NaN
3    James   4    NaN

**7. Display only the odd rows**

In [83]:
df

  students  id  marks
4    Sarah   5   90.0
0      Joe   1   77.0
2     Adam   3   57.0
1    Helen   2    NaN
3    James   4    NaN

In [100]:
df.iloc[df.index % 2 != 0]

  students  id  marks
1    Helen   2    NaN
3    James   4    NaN